"Andromeda" = "أندروميدا";
"Antlia" = "أنتليا";
"Apus" = "أبس";
"Aquarius" = "برج الدلو";
"Aquila" = "أكويلا";
"Ara" = "ايرا";
"Aries" = "برج الحمل";
"Auriga" = "أورجا";
"Boötes" = "بيوتس";
"Caelum" = "كيوم";
"Camelopardalis" = "كاملوبارداليس";
"Cancer" = "سرطان";
"Canes Venatici" = "كانز فيناتيشي";
"Canis Major" = "كانيس كبير";
"Canis Minor" = "كانيس صغير";
"Capricornus" = "كابريكورنس";
"Carina" = "كاراينا";
"Cassiopeia" = "كاسيوبيا";
"Centaurus" = "سنتوراس";
"Cepheus" = "سيفيوس";
"Cetus" = "سيتس";
"Chamaeleon" = "شاميليون";
"Circinus" = "سيريسنس";
"Columba" = "كولومبا";
"Coma Berenices" = "كوما برانيسيز";
"Corona Australis" = "كورونا أوسترالس";
"Corona Borealis" = "كورونا بوريلس";
"Corvus" = "كورفس";
"Crater" = "فوهة بركان";
"Crux" = "جوهره";
"Cygnus" = "سيقنس";
"Delphinus" = "ديلفينس";
"Dorado" = "دورادو";
"Draco" = "دريكو";
"Equuleus" = "اكيولياس";
"Eridanus" = "اريدنس";
"Fornax" = "فورناكس";
"Gemini" = "الجوزاء";
"Grus" = "قرس";
"Hercules" = "هركليز";
"Horologium" = "هورولوجم";
"Hydrus" = "هايدرس";
"Indus" = "اندس";
"Lacerta" = "لاسيرتا";
"Leo" = "برج الأسد";
"Leo Minor" = "برج الأسد الصغير";
"Lepus" = "ليبس";
"Libra" = "برج الميزان";
"Lupus" = "داء الذئبة";
"Lynx" = "الوشق";
"Lyra" = "لايرا";
"Mensa" = "منسا";
"Microscopium" = "ميكروسكوبيوم";
"Monoceros" = "مونوسيروس";
"Musca" = "موكا";
"Norma" = "نورما";
"Octans" = "أوكتنز";
"Ophiuchus" = "أوفيتشيس";
"Orion" = "أوراين";
"Pavo" = "بافو";
"Pegasus" = "بيقاسوس";
"Perseus" = "برسيوس";
"Phoenix" = "العنقاء";
"Pictor" = "بكتور";
"Pisces" = "برج الحوت";
"Piscis Austrinus" = "بيسس أوسترينوس";
"Puppis" = "بوبيس";
"Pyxis" = "بايكسوس";
"Reticulum" = "ريتيكيولم";
"Sagitta" = "ساجيتا";
"Sagittarius" = "برج القوس";
"Scorpius" = "برج العقرب";
"Sculptor" = "النحات";
"Scutum" = "سكيوتم";
"Serpens Caput" = "سيربنس كابوت";
"Serpens Cauda" = "سيربنس كودا";
"Sextans" = "سيكستانس";
"Taurus" = "برج الثور";
"Telescopium" = "تيليسكوبيام";
"Triangulum" = "ترايانقيولم";
"Triangulum Australe" = "ترايانقيولم أوستريل";
"Tucana" = "توكانا";
"Ursa Major" = "الدب الأكبر";
"Ursa Minor" = "الدب الأصغر";
"Vela" = "فيلا";
"Virgo" = "برج العذراء";
"Volans" = "فولانز";
"Vulpecula" = "فيباكيولا";
